[
  {
    "company": {
      "ru": "ООО ЗЕФИРЛАБ",
      "en": "ZephyrLab Ltd"
    },
    "date": {
      "started_at": "2020-12-01",
      "ended_at": "2022-09-01"
    },
    "description": {
      "ru": "Внедрение функционала редактора карточек товара на React + redux-toolkit. Разработка новостной ленты и оповещения событий посредством react-query. Реализация авторизации на сервисе и определение ролей для возможности включения доступного функционала. Адаптивная кросс-браузерная верстка основного лендинга сервиса и промо-лендингов. Прототипирование шаблонов .hbs (Handlebars.js) и многое другое.",
      "en": "Implementation of the functionality of the product card editor on React + redux-toolkit. Embedding newsfeed and events with react-query. Implementation of authorization on the service and definition of roles to enable the available functionality. Adaptive cross-browser layout of the main landing page and promo landing pages of the service. Prototyping .hbs templates (Handlebars.js) and more."
    },
    "image": {
      "name": "saharok.store",
      "color": "#FFDFEF"
    },
    "inn": 5047251369,
    "location": {
      "ru": "Россия, Московская обл., г. Долгопрудный",
      "en": "Russia, Moscow region, Dolgoprudny"
    },
    "products": ["https://saharok.store", "https://saharok.info"],
    "profession": {
      "ru": "Frontend Разработчик",
      "en": "Frontend Developer"
    },
    "url": "https://saharok.info/"
  },
  {
    "company": {
      "ru": "ООО ИНТЭНТ",
      "en": "Intent Ltd"
    },
    "date": {
      "started_at": "2022-09-01",
      "ended_at": "%current%"
    },
    "description": {
      "ru": "Разработка Front-End сервисов БилдДокс (ИД и ПИР) с использованием React и MUI-фреймворка. Взаимодействие с API микросервисной архитектуры: профили, организации, проекты, договоры, исполнительная документация, уведомления (посредством react-query, axios). Написание unit-тестов с помощью Jest, @testing-library/react. Внедрение нового функционала, интеграция ЭЦП и данных сервисов-партнеров, работа с внешними API и многое другое.",
      "en": "Development of BuildDocs Front-End services using React and MUI framework. Interaction with the microservice architecture API: profiles, organizations, projects, contracts, executive documentation, notifications (via react-query, axios). Writing unit tests with Jest, @testing-library/react. Implementation of new functionality, integration of EDS and data from partner, work with external APIs services and more."
    },
    "image": {
      "name": "BuildDocs",
      "color": "#A1DCFF"
    },
    "inn": 7839136848,
    "location": {
      "ru": "Россия, г. Санкт-Петербург",
      "en": "Russia, St. Petersburg"
    },
    "products": ["https://pir.builddocs.online", "https://builddocs.online"],
    "profession": {
      "ru": "Frontend Разработчик",
      "en": "Frontend Developer"
    },
    "url": "https://builddocs.ru/"
  }
]
